frontend/controllers/SiteController.php

    protected function countAllStudent()
    {
        return Student::find()->count('id');
---
SELECT COUNT(id) FROM `student`

    protected function countAppliedStudent()
    {
        return Student::find()->where(['status' => 1])->count('id');
---
SELECT COUNT(id) FROM `student` WHERE `status`=1

    protected function countProsessingStudent()
    {
        return Student::find()->where(['status' => 0])->count('id');
---
SELECT COUNT(id) FROM `student` WHERE `status`=0