frontend/components/CommentWidget.php

    public function init()
    {
        $this->comment = Comment::find()->where(['status' => 1])->all();
---
SELECT * FROM `comment` WHERE `status`=1