frontend/components/PortfoloWidget.php

SELECT * FROM `gallery`
---
public function init()
{
    $this->gallery = Gallery::find()->all();