frontend/components/ServicesWidget.php

    public function init()
{
    $this->dormitory = Dormitory::find()->all();
---
SELECT * FROM `dormitory`