frontend/components/views/contact.php

                <?= $form->field($model, 'l_name',['options' =>['class' => 'col-md-6']])->textInput(['placeholder' => 'Familya'])?>
                <?= $form->field($model, 'm_name',['options' =>['class' => 'col-md-12']])->textInput(['placeholder' => 'Sharif'])?>

                <?= $form->field($model, 'region_id',['options' =>['class' => 'col-md-6']])->dropdownList(ArrayHelper::map(\common\models\Region::find()->all(),'id','name'),
                    [
                        'prompt' =>'tanlang',
                        'onchange' => '$.post("'.\yii\helpers\Url::to(['site/districtlists?id=']).'"+$(this).val(),function(data){
    $("select#student-district_id").html(data)});'
                    ])?>
                <?= $form->field($model, 'district_id',['options' =>['class' => 'col-md-6']])->dropdownList(ArrayHelper::map(District::find()->all(),'id', 'name'),['prompt' =>'tanlang'])?>
                <?= $form->field($model, 'faculty_id',['options' =>['class' => 'col-md-6']])->dropdownList(ArrayHelper::map(Faculty::find()->all(),'id','name'),
                    [
                        'prompt' =>'tanlang',
                        'onchange' => '$.post("'.\yii\helpers\Url::to(['site/departmentlists?id=']).'"+$(this).val(),function(data){
    $("select#student-department_id").html(data)});'
                    ])?>
                <?= $form->field($model, 'department_id',['options' =>['class' => 'col-md-6']])->dropdownList(ArrayHelper::map(Department::find()->all(),'id','name'),['prompt' =>'tanlang'])?>
---
SELECT * FROM `region`
SELECT * FROM `district`
SELECT * FROM `faculty`
SELECT * FROM `department`